// Даны два числа. Показать большее и меньшее число

int min, max;
min = 3; max = 43;
Console.WriteLine(min);
Console.WriteLine(max);
Console.ReadKey();